dunknowcoding/NiusBurner/niusburner/arduino/mcs51/boards.txt
at89s8252.menu.optimize.size=Size (default)
at89s8252.menu.optimize.size.build.nb_optimize=size
at89s8252.menu.optimize.speed=Speed
at89s8252.menu.optimize.speed.build.nb_optimize=speed
at89s8252.menu.optimize.none=None
at89s8252.menu.optimize.none.build.nb_optimize=none

at89s8252.menu.compiler.auto=Auto-detect SDCC (default)
at89s8252.menu.compiler.auto.build.nb_compiler=auto
at89s8252.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89s8252.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 12 KB flash plus 2 KB EEPROM. Same serial-ISP protocol; the EEPROM is not written by this tool.
at89s8253.name=AT89S8253 (12 KB, USB-ISP)
at89s8253.upload.tool=niusburner
at89s8253.upload.protocol=usbisp_hid
at89s8253.upload.maximum_size=12288
at89s8253.upload.maximum_data_size=256
at89s8253.upload.require_upload_port=false
at89s8253.build.mcu=at89s8253
at89s8253.build.f_cpu=11059200L
at89s8253.build.board=AT89S8253
at89s8253.build.core=niusburner
at89s8253.build.variant=standard
at89s8253.build.nb_board=at89s8253
at89s8253.build.extra_flags=

at89s8253.menu.optimize.size=Size (default)
at89s8253.menu.optimize.size.build.nb_optimize=size
at89s8253.menu.optimize.speed=Speed
at89s8253.menu.optimize.speed.build.nb_optimize=speed
at89s8253.menu.optimize.none=None
at89s8253.menu.optimize.none.build.nb_optimize=none

at89s8253.menu.compiler.auto=Auto-detect SDCC (default)
at89s8253.menu.compiler.auto.build.nb_compiler=auto
at89s8253.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
at89s8253.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# SST, 20 KB flash. No serial-ISP interface: this part is written in a parallel programming socket, so it compiles here but the Upload button cannot drive it.
sst89e54.name=SST89E54 (20 KB, compile only)
sst89e54.upload.tool=niusburner
sst89e54.upload.protocol=parallel_hv
sst89e54.upload.maximum_size=20480
sst89e54.upload.maximum_data_size=256
sst89e54.upload.require_upload_port=false
sst89e54.build.mcu=sst89e54
sst89e54.build.f_cpu=11059200L
sst89e54.build.board=SST89E54
sst89e54.build.core=niusburner
sst89e54.build.variant=standard
sst89e54.build.nb_board=sst89e54
sst89e54.build.extra_flags=

sst89e54.menu.optimize.size=Size (default)
sst89e54.menu.optimize.size.build.nb_optimize=size
sst89e54.menu.optimize.speed=Speed
sst89e54.menu.optimize.speed.build.nb_optimize=speed
sst89e54.menu.optimize.none=None
sst89e54.menu.optimize.none.build.nb_optimize=none

sst89e54.menu.compiler.auto=Auto-detect SDCC (default)
sst89e54.menu.compiler.auto.build.nb_compiler=auto
sst89e54.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
sst89e54.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# SST, 64 KB flash. No serial-ISP interface: this part is written in a parallel programming socket, so it compiles here but the Upload button cannot drive it.
sst89e564.name=SST89E564 (64 KB, compile only)
sst89e564.upload.tool=niusburner
sst89e564.upload.protocol=parallel_hv
sst89e564.upload.maximum_size=65536
sst89e564.upload.maximum_data_size=256
sst89e564.upload.require_upload_port=false
sst89e564.build.mcu=sst89e564
sst89e564.build.f_cpu=11059200L
sst89e564.build.board=SST89E564
sst89e564.build.core=niusburner
sst89e564.build.variant=standard
sst89e564.build.nb_board=sst89e564
sst89e564.build.extra_flags=

sst89e564.menu.optimize.size=Size (default)
sst89e564.menu.optimize.size.build.nb_optimize=size
sst89e564.menu.optimize.speed=Speed
sst89e564.menu.optimize.speed.build.nb_optimize=speed
sst89e564.menu.optimize.none=None
sst89e564.menu.optimize.none.build.nb_optimize=none

sst89e564.menu.compiler.auto=Auto-detect SDCC (default)
sst89e564.menu.compiler.auto.build.nb_compiler=auto
sst89e564.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
sst89e564.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 4 KB flash. Same UART bootloader as the STC89C52RC.
stc89c51rc.name=STC89C51RC (4 KB, serial bootloader)
stc89c51rc.upload.tool=niusburner
stc89c51rc.upload.protocol=stcgal
stc89c51rc.upload.maximum_size=4096
stc89c51rc.upload.maximum_data_size=256
stc89c51rc.upload.require_upload_port=true
stc89c51rc.build.mcu=stc89c51rc
stc89c51rc.build.f_cpu=11059200L
stc89c51rc.build.board=STC89C51RC
stc89c51rc.build.core=niusburner
stc89c51rc.build.variant=standard
stc89c51rc.build.nb_board=stc89c51rc
stc89c51rc.build.extra_flags=

stc89c51rc.menu.optimize.size=Size (default)
stc89c51rc.menu.optimize.size.build.nb_optimize=size
stc89c51rc.menu.optimize.speed=Speed
stc89c51rc.menu.optimize.speed.build.nb_optimize=speed
stc89c51rc.menu.optimize.none=None
stc89c51rc.menu.optimize.none.build.nb_optimize=none

stc89c51rc.menu.reset.none=None - interrupt power by hand (default)
stc89c51rc.menu.reset.none.build.nb_reset=none
stc89c51rc.menu.reset.dtr=Adapter DTR switches VDD
stc89c51rc.menu.reset.dtr.build.nb_reset=dtr
stc89c51rc.menu.reset.rts=Adapter RTS switches VDD
stc89c51rc.menu.reset.rts.build.nb_reset=rts

stc89c51rc.menu.entry.none=Interrupt power by hand (default)
stc89c51rc.menu.entry.none.build.nb_entry=none
stc89c51rc.menu.entry.soft=Sketch reboots itself into the bootloader
stc89c51rc.menu.entry.soft.build.nb_entry=soft

stc89c51rc.menu.compiler.auto=Auto-detect SDCC (default)
stc89c51rc.menu.compiler.auto.build.nb_compiler=auto
stc89c51rc.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc89c51rc.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# UART bootloader (stcgal) on the serial adapter, not the ISP header. Entry is power-on only, so the board needs a supply that can be interrupted. Reports 8 KB code flash and a 12-clock machine cycle, so the AT89S52 timing carries over.
stc89c52rc.name=STC89C52RC (8 KB, serial bootloader)
stc89c52rc.upload.tool=niusburner
stc89c52rc.upload.protocol=stcgal
stc89c52rc.upload.maximum_size=8192
stc89c52rc.upload.maximum_data_size=256
stc89c52rc.upload.require_upload_port=true
stc89c52rc.build.mcu=stc89c52rc
stc89c52rc.build.f_cpu=11059200L
stc89c52rc.build.board=STC89C52RC
stc89c52rc.build.core=niusburner
stc89c52rc.build.variant=standard
stc89c52rc.build.nb_board=stc89c52rc
stc89c52rc.build.extra_flags=

stc89c52rc.menu.optimize.size=Size (default)
stc89c52rc.menu.optimize.size.build.nb_optimize=size
stc89c52rc.menu.optimize.speed=Speed
stc89c52rc.menu.optimize.speed.build.nb_optimize=speed
stc89c52rc.menu.optimize.none=None
stc89c52rc.menu.optimize.none.build.nb_optimize=none

stc89c52rc.menu.reset.none=None - interrupt power by hand (default)
stc89c52rc.menu.reset.none.build.nb_reset=none
stc89c52rc.menu.reset.dtr=Adapter DTR switches VDD
stc89c52rc.menu.reset.dtr.build.nb_reset=dtr
stc89c52rc.menu.reset.rts=Adapter RTS switches VDD
stc89c52rc.menu.reset.rts.build.nb_reset=rts

stc89c52rc.menu.entry.none=Interrupt power by hand (default)
stc89c52rc.menu.entry.none.build.nb_entry=none
stc89c52rc.menu.entry.soft=Sketch reboots itself into the bootloader
stc89c52rc.menu.entry.soft.build.nb_entry=soft

stc89c52rc.menu.compiler.auto=Auto-detect SDCC (default)
stc89c52rc.menu.compiler.auto.build.nb_compiler=auto
stc89c52rc.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc89c52rc.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 12 KB flash. Same STC89-generation UART bootloader as the STC89C52RC, entered on power-on.
stc89c53rc.name=STC89C53RC (12 KB, serial bootloader)
stc89c53rc.upload.tool=niusburner
stc89c53rc.upload.protocol=stcgal
stc89c53rc.upload.maximum_size=12288
stc89c53rc.upload.maximum_data_size=256
stc89c53rc.upload.require_upload_port=true
stc89c53rc.build.mcu=stc89c53rc
stc89c53rc.build.f_cpu=11059200L
stc89c53rc.build.board=STC89C53RC
stc89c53rc.build.core=niusburner
stc89c53rc.build.variant=standard
stc89c53rc.build.nb_board=stc89c53rc
stc89c53rc.build.extra_flags=

