dunknowcoding/NiusBurner/niusburner/arduino/mcs51/boards.txt
stc90c52rc.menu.entry.none=Interrupt power by hand (default)
stc90c52rc.menu.entry.none.build.nb_entry=none
stc90c52rc.menu.entry.soft=Sketch reboots itself into the bootloader
stc90c52rc.menu.entry.soft.build.nb_entry=soft

stc90c52rc.menu.compiler.auto=Auto-detect SDCC (default)
stc90c52rc.menu.compiler.auto.build.nb_compiler=auto
stc90c52rc.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc90c52rc.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# 32 KB flash. Same STC89-generation UART bootloader as the STC89C52RC, entered on power-on.
stc90c58rd.name=STC90C58RD (32 KB, serial bootloader)
stc90c58rd.upload.tool=niusburner
stc90c58rd.upload.protocol=stcgal
stc90c58rd.upload.maximum_size=32768
stc90c58rd.upload.maximum_data_size=256
stc90c58rd.upload.require_upload_port=true
stc90c58rd.build.mcu=stc90c58rd
stc90c58rd.build.f_cpu=11059200L
stc90c58rd.build.board=STC90C58RD
stc90c58rd.build.core=niusburner
stc90c58rd.build.variant=standard
stc90c58rd.build.nb_board=stc90c58rd
stc90c58rd.build.extra_flags=

stc90c58rd.menu.optimize.size=Size (default)
stc90c58rd.menu.optimize.size.build.nb_optimize=size
stc90c58rd.menu.optimize.speed=Speed
stc90c58rd.menu.optimize.speed.build.nb_optimize=speed
stc90c58rd.menu.optimize.none=None
stc90c58rd.menu.optimize.none.build.nb_optimize=none

stc90c58rd.menu.reset.none=None - interrupt power by hand (default)
stc90c58rd.menu.reset.none.build.nb_reset=none
stc90c58rd.menu.reset.dtr=Adapter DTR switches VDD
stc90c58rd.menu.reset.dtr.build.nb_reset=dtr
stc90c58rd.menu.reset.rts=Adapter RTS switches VDD
stc90c58rd.menu.reset.rts.build.nb_reset=rts

stc90c58rd.menu.entry.none=Interrupt power by hand (default)
stc90c58rd.menu.entry.none.build.nb_entry=none
stc90c58rd.menu.entry.soft=Sketch reboots itself into the bootloader
stc90c58rd.menu.entry.soft.build.nb_entry=soft

stc90c58rd.menu.compiler.auto=Auto-detect SDCC (default)
stc90c58rd.menu.compiler.auto.build.nb_compiler=auto
stc90c58rd.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
stc90c58rd.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# Winbond, 4 KB flash. No serial-ISP interface: this part is written in a parallel programming socket, so it compiles here but the Upload button cannot drive it.
w78e51.name=W78E51 (4 KB, compile only)
w78e51.upload.tool=niusburner
w78e51.upload.protocol=parallel_hv
w78e51.upload.maximum_size=4096
w78e51.upload.maximum_data_size=128
w78e51.upload.require_upload_port=false
w78e51.build.mcu=w78e51
w78e51.build.f_cpu=11059200L
w78e51.build.board=W78E51
w78e51.build.core=niusburner
w78e51.build.variant=standard
w78e51.build.nb_board=w78e51
w78e51.build.extra_flags=

w78e51.menu.optimize.size=Size (default)
w78e51.menu.optimize.size.build.nb_optimize=size
w78e51.menu.optimize.speed=Speed
w78e51.menu.optimize.speed.build.nb_optimize=speed
w78e51.menu.optimize.none=None
w78e51.menu.optimize.none.build.nb_optimize=none

w78e51.menu.compiler.auto=Auto-detect SDCC (default)
w78e51.menu.compiler.auto.build.nb_compiler=auto
w78e51.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
w78e51.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# Winbond, 8 KB flash. No serial-ISP interface: this part is written in a parallel programming socket, so it compiles here but the Upload button cannot drive it.
w78e52.name=W78E52 (8 KB, compile only)
w78e52.upload.tool=niusburner
w78e52.upload.protocol=parallel_hv
w78e52.upload.maximum_size=8192
w78e52.upload.maximum_data_size=256
w78e52.upload.require_upload_port=false
w78e52.build.mcu=w78e52
w78e52.build.f_cpu=11059200L
w78e52.build.board=W78E52
w78e52.build.core=niusburner
w78e52.build.variant=standard
w78e52.build.nb_board=w78e52
w78e52.build.extra_flags=

w78e52.menu.optimize.size=Size (default)
w78e52.menu.optimize.size.build.nb_optimize=size
w78e52.menu.optimize.speed=Speed
w78e52.menu.optimize.speed.build.nb_optimize=speed
w78e52.menu.optimize.none=None
w78e52.menu.optimize.none.build.nb_optimize=none

w78e52.menu.compiler.auto=Auto-detect SDCC (default)
w78e52.menu.compiler.auto.build.nb_compiler=auto
w78e52.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
w78e52.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# Winbond, 16 KB flash. No serial-ISP interface: this part is written in a parallel programming socket, so it compiles here but the Upload button cannot drive it.
w78e54.name=W78E54 (16 KB, compile only)
w78e54.upload.tool=niusburner
w78e54.upload.protocol=parallel_hv
w78e54.upload.maximum_size=16384
w78e54.upload.maximum_data_size=256
w78e54.upload.require_upload_port=false
w78e54.build.mcu=w78e54
w78e54.build.f_cpu=11059200L
w78e54.build.board=W78E54
w78e54.build.core=niusburner
w78e54.build.variant=standard
w78e54.build.nb_board=w78e54
w78e54.build.extra_flags=

w78e54.menu.optimize.size=Size (default)
w78e54.menu.optimize.size.build.nb_optimize=size
w78e54.menu.optimize.speed=Speed
w78e54.menu.optimize.speed.build.nb_optimize=speed
w78e54.menu.optimize.none=None
w78e54.menu.optimize.none.build.nb_optimize=none

w78e54.menu.compiler.auto=Auto-detect SDCC (default)
w78e54.menu.compiler.auto.build.nb_compiler=auto
w78e54.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
w78e54.menu.compiler.configured.build.nb_compiler=configured

# ----------------------------------------------------------------------
# Winbond, 32 KB flash. No serial-ISP interface: this part is written in a parallel programming socket, so it compiles here but the Upload button cannot drive it.
w78e58.name=W78E58 (32 KB, compile only)
w78e58.upload.tool=niusburner
w78e58.upload.protocol=parallel_hv
w78e58.upload.maximum_size=32768
w78e58.upload.maximum_data_size=256
w78e58.upload.require_upload_port=false
w78e58.build.mcu=w78e58
w78e58.build.f_cpu=11059200L
w78e58.build.board=W78E58
w78e58.build.core=niusburner
w78e58.build.variant=standard
w78e58.build.nb_board=w78e58
w78e58.build.extra_flags=

w78e58.menu.optimize.size=Size (default)
w78e58.menu.optimize.size.build.nb_optimize=size
w78e58.menu.optimize.speed=Speed
w78e58.menu.optimize.speed.build.nb_optimize=speed
w78e58.menu.optimize.none=None
w78e58.menu.optimize.none.build.nb_optimize=none

w78e58.menu.compiler.auto=Auto-detect SDCC (default)
w78e58.menu.compiler.auto.build.nb_compiler=auto
w78e58.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
w78e58.menu.compiler.configured.build.nb_compiler=configured
